test/vcr_cassettes/recurring/delete_subscription_success.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:07 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '274'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=135537644
  recorded_at: Thu, 20 Nov 2025 23:30:07 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault_id=135537644&day_of_month=15&month_frequency=1&payment=creditcard&plan_amount=19.99&plan_payments=0&recurring=add_subscription&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:08 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '472'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Subscription added&authcode=&transactionid=11386674381&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&customer_vault_id=135537644&subscription_id=11386674381
  recorded_at: Thu, 20 Nov 2025 23:30:08 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&payment=creditcard&recurring=delete_subscription&security_key=<NMI_SECURITY_KEY>&subscription_id=11386674381&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:09 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '286'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Recurring Transaction Deleted&authcode=&transactionid=11386674381&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&subscription_id=11386674381
  recorded_at: Thu, 20 Nov 2025 23:30:09 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault=delete_customer&customer_vault_id=135537644&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:09 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '259'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Deleted&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:09 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 21 Nov 2025 04:33:32 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '297'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=1007104918
  recorded_at: Fri, 21 Nov 2025 04:33:32 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 21 Nov 2025 05:01:33 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '259'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=221031719
  recorded_at: Fri, 21 Nov 2025 05:01:33 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Fri, 21 Nov 2025 05:02:19 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '249'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=2109389977
  recorded_at: Fri, 21 Nov 2025 05:02:20 GMT
recorded_with: VCR 6.3.1
