test/vcr_cassettes/recurring/add_custom_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1225&ccnumber=4111111111111111&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=999&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:36 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '416'
      Set-Cookie:
      - '068303=iEVTmoulFRmWa36L4zLMGAtagzIgc7anuXnXOaJ7Eq1jaPbwlt1A24TTE622oznWkTKXNn3iITT5OClJciw8aHbsMfkGzUhKDKXTC0upBl66NahimhrT4Qaic8uV578DluX3vRQh4Zi0SvF2g/hPR7pb3c9ibUpQz32/w271IvvsYt7z;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=242650683
  recorded_at: Wed, 29 Oct 2025 21:12:36 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault_id=242650683&day_of_month=15&month_frequency=1&payment=creditcard&plan_amount=19.99&plan_payments=0&recurring=add_subscription&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:36 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '721'
      Set-Cookie:
      - '068303=o90qInhPX7iVYQEgvHWl3aTsaaCgv7wgl5Y5CPlDWZcokzV5MrWmxXND1E3DMRAYbGNHuBXaenVnGYH9lwtCKfDaHK2lNnL9LE+NdJJbbwoZ3NF3ws67WWXWm5ayAgciUix7ec8UHxhYl2h7F2rD0ws+AfcktvNBaaGgGhpp0UnYJZ81;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Subscription added&authcode=&transactionid=11304357728&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&customer_vault_id=242650683&subscription_id=11304357728
  recorded_at: Wed, 29 Oct 2025 21:12:37 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&payment=creditcard&recurring=delete_subscription&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&subscription_id=11304357728&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:37 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '491'
      Set-Cookie:
      - '068303=NoQwxpCFdklKGbhRSaLUwoPFNqYl7YT5tqLUWzyIpRyrT4wN0uJVulpKUWRR6mnvfIhUE8HWeFyg21ITQuXK2067OaJ+7f1Po0vSFWvZR3HLtOQOAON6XYSiWraMiVJaQ/4Q/KcuAuRCUsVdFZpzYM6ZfAEE4omd9fOkch2CNs2J1g/J;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Recurring Transaction Deleted&authcode=&transactionid=11304357728&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&subscription_id=11304357728
  recorded_at: Wed, 29 Oct 2025 21:12:37 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault=delete_customer&customer_vault_id=242650683&payment=creditcard&security_key=6457Thfj624V5r7WUwc5v6a68Zsd6YEm&test_mode=enabled
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 29 Oct 2025 21:12:38 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '507'
      Set-Cookie:
      - '068303=6J9Nyub5QxT5vMj5BPZESkJ1uisyS3nvVat/E56oCV6VwREWj3xNiloKBqUSOulMl9Jb366y85MV0xHMgTnWRHjdMcCVGYvugWBhPW02O12KAtPYm6MamUIbbPZzsTIWf1kICjXV7hnbu/wcUs1+4qkt23cfTyopUcjlJWi6TQZCQwn4;
        path=/'
      X-Volterra-Location:
      - wes-sea
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Deleted&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100
  recorded_at: Wed, 29 Oct 2025 21:12:38 GMT
recorded_with: VCR 6.3.1
