test/vcr_cassettes/recurring/complete_lifecycle.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&day_of_month=1&month_frequency=1&payment=creditcard&plan_amount=29.99&plan_id=vcr-test-plan-lifecycle-1763681426609663&plan_name=Test%20Monthly%20Plan&plan_payments=0&recurring=add_plan&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:27 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '292'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Plan Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:27 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:27 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '276'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=1397619961
  recorded_at: Thu, 20 Nov 2025 23:30:27 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault_id=1397619961&payment=creditcard&plan_id=vcr-test-plan-lifecycle-1763681426609663&recurring=add_subscription&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:28 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '366'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Subscription added&authcode=&transactionid=11386675361&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&customer_vault_id=1397619961&subscription_id=11386675361
  recorded_at: Thu, 20 Nov 2025 23:30:28 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&payment=creditcard&plan_amount=34.99&recurring=update_subscription&security_key=<NMI_SECURITY_KEY>&subscription_id=11386675361&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:29 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '329'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Subscription Updated&authcode=&transactionid=11386675361&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&subscription_id=11386675361
  recorded_at: Thu, 20 Nov 2025 23:30:29 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&payment=creditcard&recurring=delete_subscription&security_key=<NMI_SECURITY_KEY>&subscription_id=11386675361&test_mode=enabled&type=recurring
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:29 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '216'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Recurring Transaction Deleted&authcode=&transactionid=11386675361&avsresponse=&cvvresponse=&orderid=&type=recurring&response_code=100&subscription_id=11386675361
  recorded_at: Thu, 20 Nov 2025 23:30:29 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault=delete_customer&customer_vault_id=1397619961&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:31 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '243'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Deleted&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:31 GMT
recorded_with: VCR 6.3.1
